"""day01-01
01-hello-python.py

1. 변수
 - (변하는)값을 저장하는 공간에 이름을 붙힌 것이다.
    1) 타입을 지정할 필요가 없다.
     - 언어에 따라서, 사용할 변수의 타입(문자열, 숫자, 리스트 등)을 명시해야 한다.
       ex) 자바 -> String name = "최수호"
 - 변수 명은 영문자나 _로 시작하여야 한다.
 - 변수 명으로 예약어를 사용할 수 없다.
 ※ 예약어 : 언어 내에서 이미 특정 기능을 수행중인 명칭 (Ex: for, if, else)
   
2. 함수
 - 특정 작업(기능)을 수행하는 코드를 묶어서 이름을 붙힌 것이다.

"""

name = "최수호"                   # 문자형 변수
age = 30                         # 숫자형 변수
hobbies = ["excercise", "game"]  # 리스트 변수


print(name)
print(age)
print(hobbies)
